{"class_name": "Functional", "config": {"name": "model_20", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_62"}, "registered_name": null, "name": "input_62", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 25], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_61"}, "registered_name": null, "name": "input_61", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_254", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "batch_normalization_254", "inbound_nodes": [[["input_62", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_253", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 25]}, "name": "batch_normalization_253", "inbound_nodes": [[["input_61", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.reshape_20", "trainable": true, "dtype": "float32", "function": "reshape"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 1]}, "name": "tf.reshape_20", "inbound_nodes": [["batch_normalization_254", 0, 0, {"shape": [-1, 1, 1]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.math.truediv_20", "trainable": true, "dtype": "float32", "function": "math.truediv"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 1, 25]}, "name": "tf.math.truediv_20", "inbound_nodes": [["batch_normalization_253", 0, 0, {"y": ["tf.reshape_20", 0, 0], "name": null}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.concat_41", "trainable": true, "dtype": "float32", "function": "concat"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [[null, 1, 25], [null, 1, 25]]}, "name": "tf.concat_41", "inbound_nodes": [[["batch_normalization_253", 0, 0, {"axis": 1}], ["tf.math.truediv_20", 0, 0, {"axis": 1}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_41", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 2, 25]}, "name": "tf.compat.v1.pad_41", "inbound_nodes": [["tf.concat_41", 0, 0, {"paddings": [[0, 0], [0, 2], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_255", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 25]}, "name": "batch_normalization_255", "inbound_nodes": [[["tf.compat.v1.pad_41", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_63"}, "registered_name": null, "name": "input_63", "inbound_nodes": []}, {"module": null, "class_name": "my_mha_atn", "config": {"name": "my_mha_atn_44", "trainable": true, "dtype": "float32", "n_hds": 8, "dim": 40, "out_len": null, "dropout": 0.2, "attn_axs": null}, "registered_name": "MyLayers>my_mha_atn", "build_config": {"input_shape": [null, 4, 25]}, "name": "my_mha_atn_44", "inbound_nodes": [[["batch_normalization_255", 0, 0, {"ky": ["input_63", 0, 0]}]]]}, {"module": null, "class_name": "my_mha", "config": {"name": "my_mha_66", "trainable": true, "dtype": "float32", "n_hds": 5, "dim": 30, "out_len": null, "dropout": 0.2, "attn_axs": null}, "registered_name": "MyLayers>my_mha", "build_config": {"input_shape": [null, 4, 100]}, "name": "my_mha_66", "inbound_nodes": [[["my_mha_atn_44", 0, 0, {"ky": ["my_mha_atn_44", 0, 0], "use_causal_mask": true}]]]}, {"module": null, "class_name": "my_mha_atn", "config": {"name": "my_mha_atn_45", "trainable": true, "dtype": "float32", "n_hds": 7, "dim": 30, "out_len": null, "dropout": 0.2, "attn_axs": null}, "registered_name": "MyLayers>my_mha_atn", "build_config": {"input_shape": [null, 4, 100]}, "name": "my_mha_atn_45", "inbound_nodes": [[["my_mha_66", 0, 0, {"ky": ["input_63", 0, 0]}]]]}, {"module": null, "class_name": "my_mha", "config": {"name": "my_mha_67", "trainable": true, "dtype": "float32", "n_hds": 5, "dim": 30, "out_len": null, "dropout": 0.2, "attn_axs": null}, "registered_name": "MyLayers>my_mha", "build_config": {"input_shape": [null, 4, 100]}, "name": "my_mha_67", "inbound_nodes": [[["my_mha_atn_45", 0, 0, {"ky": ["input_63", 0, 0]}]]]}, {"module": null, "class_name": "my_mha", "config": {"name": "my_mha_68", "trainable": true, "dtype": "float32", "n_hds": 8, "dim": 40, "out_len": null, "dropout": 0.2, "attn_axs": null}, "registered_name": "MyLayers>my_mha", "build_config": {"input_shape": [null, 4, 100]}, "name": "my_mha_68", "inbound_nodes": [[["my_mha_67", 0, 0, {"ky": ["my_mha_67", 0, 0], "use_causal_mask": true}]]]}], "input_layers": [["input_61", 0, 0], ["input_63", 0, 0], ["input_62", 0, 0]], "output_layers": [["my_mha_68", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}