{"class_name": "Functional", "config": {"name": "model_4", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 25], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_13"}, "registered_name": null, "name": "input_13", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 40, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 9.999999747378752e-06}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 25]}, "name": "dense_33", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 40, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": {"module": "keras.regularizers", "class_name": "L2", "config": {"l2": 9.999999747378752e-06}, "registered_name": null}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 1, 25]}, "name": "dense_34", "inbound_nodes": [[["input_13", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.concat_6", "trainable": true, "dtype": "float32", "function": "concat"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [[null, 1, 40], [null, 1, 40]]}, "name": "tf.concat_6", "inbound_nodes": [[["dense_33", 0, 0, {"axis": 1}], ["dense_34", 0, 0, {"axis": 1}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.pad_6", "trainable": true, "dtype": "float32", "function": "compat.v1.pad"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 2, 40]}, "name": "tf.compat.v1.pad_6", "inbound_nodes": [["tf.concat_6", 0, 0, {"paddings": [[0, 0], [0, 2], [0, 0]], "mode": "CONSTANT", "name": null, "constant_values": 0}]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 40]}, "name": "batch_normalization_26", "inbound_nodes": [[["tf.compat.v1.pad_6", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_14"}, "registered_name": null, "name": "input_14", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_16", "trainable": true, "dtype": "float32", "num_heads": 10, "key_dim": 30, "value_dim": 30, "dropout": 0.2, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 4, 40], "key_shape": [null, 300, 100], "value_shape": [null, 300, 100]}, "registered_name": null, "build_config": {"input_shape": [null, 4, 40]}, "name": "multi_head_attention_16", "inbound_nodes": [[["batch_normalization_26", 0, 0, {"value": ["input_14", 0, 0], "key": ["input_14", 0, 0], "return_attention_scores": true}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_9", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 300, 100]}, "name": "tf.expand_dims_9", "inbound_nodes": [["input_14", 0, 0, {"axis": 1}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.linalg.matmul_9", "trainable": true, "dtype": "float32", "function": "linalg.matmul"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 10, 4, 300]}, "name": "tf.linalg.matmul_9", "inbound_nodes": [["multi_head_attention_16", 0, 1, {"b": ["tf.expand_dims_9", 0, 0]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.transpose_9", "trainable": true, "dtype": "float32", "function": "compat.v1.transpose"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 10, 4, 100]}, "name": "tf.compat.v1.transpose_9", "inbound_nodes": [["tf.linalg.matmul_9", 0, 0, {"perm": [0, 2, 3, 1], "name": "transpose", "conjugate": false}]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100, 10]}, "name": "dense_36", "inbound_nodes": [[["tf.compat.v1.transpose_9", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_9", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 4, 100, 1]}, "name": "tf.compat.v1.squeeze_9", "inbound_nodes": [["dense_36", 0, 0, {"axis": -1, "name": null}]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_28", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "batch_normalization_28", "inbound_nodes": [[["tf.compat.v1.squeeze_9", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_17", "trainable": true, "dtype": "float32", "num_heads": 10, "key_dim": 30, "value_dim": 30, "dropout": 0.2, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 4, 100], "key_shape": [null, 300, 100], "value_shape": [null, 300, 100]}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "multi_head_attention_17", "inbound_nodes": [[["batch_normalization_28", 0, 0, {"value": ["input_14", 0, 0], "key": ["input_14", 0, 0], "use_causal_mask": true, "return_attention_scores": true}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_10", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 300, 100]}, "name": "tf.expand_dims_10", "inbound_nodes": [["input_14", 0, 0, {"axis": 1}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.linalg.matmul_10", "trainable": true, "dtype": "float32", "function": "linalg.matmul"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 10, 4, 300]}, "name": "tf.linalg.matmul_10", "inbound_nodes": [["multi_head_attention_17", 0, 1, {"b": ["tf.expand_dims_10", 0, 0]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.transpose_10", "trainable": true, "dtype": "float32", "function": "compat.v1.transpose"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 10, 4, 100]}, "name": "tf.compat.v1.transpose_10", "inbound_nodes": [["tf.linalg.matmul_10", 0, 0, {"perm": [0, 2, 3, 1], "name": "transpose", "conjugate": false}]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100, 10]}, "name": "dense_37", "inbound_nodes": [[["tf.compat.v1.transpose_10", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_10", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 4, 100, 1]}, "name": "tf.compat.v1.squeeze_10", "inbound_nodes": [["dense_37", 0, 0, {"axis": -1, "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_11", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "layer_normalization_11", "inbound_nodes": [[["tf.compat.v1.squeeze_10", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_11", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 4, 100], [null, 4, 100]]}, "name": "add_11", "inbound_nodes": [[["layer_normalization_11", 0, 0, {}], ["batch_normalization_28", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_29", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "batch_normalization_29", "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "MultiHeadAttention", "config": {"name": "multi_head_attention_18", "trainable": true, "dtype": "float32", "num_heads": 10, "key_dim": 30, "value_dim": 30, "dropout": 0.2, "use_bias": true, "output_shape": null, "attention_axes": [1], "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "query_shape": [null, 4, 100], "key_shape": [null, 4, 100], "value_shape": [null, 4, 100]}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "multi_head_attention_18", "inbound_nodes": [[["batch_normalization_29", 0, 0, {"value": ["batch_normalization_29", 0, 0], "key": ["batch_normalization_29", 0, 0], "return_attention_scores": true}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.expand_dims_11", "trainable": true, "dtype": "float32", "function": "expand_dims"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 4, 100]}, "name": "tf.expand_dims_11", "inbound_nodes": [["batch_normalization_29", 0, 0, {"axis": 1}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.linalg.matmul_11", "trainable": true, "dtype": "float32", "function": "linalg.matmul"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 10, 4, 4]}, "name": "tf.linalg.matmul_11", "inbound_nodes": [["multi_head_attention_18", 0, 1, {"b": ["tf.expand_dims_11", 0, 0]}]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.transpose_11", "trainable": true, "dtype": "float32", "function": "compat.v1.transpose"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 10, 4, 100]}, "name": "tf.compat.v1.transpose_11", "inbound_nodes": [["tf.linalg.matmul_11", 0, 0, {"perm": [0, 2, 3, 1], "name": "transpose", "conjugate": false}]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 1, "activation": "leaky_relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100, 10]}, "name": "dense_38", "inbound_nodes": [[["tf.compat.v1.transpose_11", 0, 0, {}]]]}, {"module": "keras.src.layers.core.tf_op_layer", "class_name": "TFOpLambda", "config": {"name": "tf.compat.v1.squeeze_11", "trainable": true, "dtype": "float32", "function": "compat.v1.squeeze"}, "registered_name": "TFOpLambda", "build_config": {"input_shape": [null, 4, 100, 1]}, "name": "tf.compat.v1.squeeze_11", "inbound_nodes": [["dense_38", 0, 0, {"axis": -1, "name": null}]]}, {"module": "keras.layers", "class_name": "LayerNormalization", "config": {"name": "layer_normalization_12", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "layer_normalization_12", "inbound_nodes": [[["tf.compat.v1.squeeze_11", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Add", "config": {"name": "add_12", "trainable": true, "dtype": "float32"}, "registered_name": null, "build_config": {"input_shape": [[null, 4, 100], [null, 4, 100]]}, "name": "add_12", "inbound_nodes": [[["layer_normalization_12", 0, 0, {}], ["batch_normalization_29", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_30", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 4, 100]}, "name": "batch_normalization_30", "inbound_nodes": [[["add_12", 0, 0, {}]]]}], "input_layers": [["input_13", 0, 0], ["input_14", 0, 0]], "output_layers": [["batch_normalization_30", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}